app/controllers/applications_controller.rb

  def index
    @applications = Application.all
---
SELECT "applications".* FROM "applications"

  def show
    @application = Application.find(params[:id])
---
SELECT "applications".* FROM "applications" WHERE "applications"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @application = Application.new(params[:application])

    respond_to do |format|
      if @application.save
---
INSERT INTO "applications" ("approval_date", "created_at", "reason", "scholarship_id", "status", "submission_date", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @application = Application.find(params[:id])
    @application.destroy
---
SELECT "applications".* FROM "applications" WHERE "applications"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "applications" WHERE "applications"."id" = ?  [["id", 1]]